app/controllers/admin/articles_controller.rb

INSERT INTO "articles" ("permalink", "updated_at", "title", "body", "user_id", "created_at") VALUES('test-article', '2009-10-10 16:39:08', 'Test Article', 'This article should post properly.', 1, '2009-10-10 16:39:08')
---
  def create
    @article = Article.new(params[:article])
    @article.user = current_user
    if @article.save

SELECT "articles".id FROM "articles" WHERE (permalink = 'test-article') LIMIT 1
---
  def find_article
    @article = Article.find(params[:id])