app/controllers/admin/photos_controller.rb

  def index
    @photos = Photo.paginate(:all, :page => params[:page], :per_page => 6)
---
SELECT * FROM "photos" LIMIT 6 OFFSET 0

  def update
    if @photo.update_attributes(params[:photo])
---
UPDATE "photos" SET "approved" = 't', "updated_at" = '2009-11-01 23:15:23' WHERE "id" = 3

  def destroy
    if @photo
      @photo.destroy
---
DELETE FROM "photos" WHERE "id" = 3

  def find_photo
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 3)