app/controllers/admin/rsvps_controller.rb

  def index
    @rsvps = Rsvp.paginate(:page => params[:page])
    @count = Rsvp.sum(:guest_count, :conditions => { :attending => true })
---
SELECT * FROM "rsvps" LIMIT 30 OFFSET 0
SELECT sum("rsvps".guest_count) AS sum_guest_count FROM "rsvps" WHERE ("rsvps"."attending" = 't')