app/controllers/articles_controller.rb

SELECT * FROM "articles" ORDER BY created_at DESC LIMIT 5 OFFSET 0
---
  def index
    @articles = Article.paginate(:all, :page => params[:page], :per_page => 5)

SELECT * FROM "articles" WHERE ("articles"."id" = 2) ORDER BY created_at DESC
---
  def show
    @article = Article.find(params[:id])