app/controllers/comments_controller.rb

INSERT INTO "comments" ("commentable_type", "updated_at", "body", "author", "commentable_id", "created_at", "email") VALUES('Article', '2009-11-08 23:23:49', 'Here''s a test!', 'Jeff', 1, '2009-11-08 23:23:49', 'trydionel@gmail.com')
---
  def create
    build_commentable
    @comment = @commentable.comments.build(params[:comment])
    if @comment.save