app/controllers/galleries_controller.rb

SELECT * FROM "galleries"
---
  def index
    @galleries = Gallery.all

SELECT "photos".* FROM "photos" WHERE ("photos".gallery_id = 1)
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)
SELECT * FROM "photos" WHERE ("photos".gallery_id = 1) AND (("photos"."approved" = 't') AND ("photos".gallery_id = 1)) LIMIT 30 OFFSET 0
---
  def show
    @gallery = Gallery.find(params[:id], :include => :photos)
    @photos = @gallery.photos.approved.paginate(:page => params[:page])