app/controllers/photos_controller.rb

  def new
    @photo = Photo.new
    @gallery = Gallery.find(params[:gallery_id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)

  def create
    @gallery = Gallery.find(params[:gallery_id])
---
SELECT * FROM "galleries" WHERE ("galleries"."id" = 1)