app/controllers/photos_controller.rb

  def index
    @photos = Photo.approved.paginate(:all, :page => params[:page], :per_page => 6)
---
SELECT * FROM "photos" WHERE ("photos"."approved" = 't') LIMIT 6 OFFSET 0

  def show
    @photo = Photo.find(params[:id])
---
SELECT * FROM "photos" WHERE ("photos"."id" = 1)

  def create
    @photo = Photo.new(params[:photo])
    if @photo.save
---
INSERT INTO "photos" ("image_file_size", "updated_at", "gallery_id", "title", "image_content_type", "approved", "image_updated_at", "image_file_name", "created_at") VALUES(1743821, '2009-10-31 23:49:09', 1, 'At the Portland Chinese Gardens', 'image/jpeg', NULL, '2009-10-31 23:49:05', 'DSC00500.JPG', '2009-10-31 23:49:09')