app/controllers/registries_controller.rb

  def index
    @registries = Registry.all
---
SELECT * FROM "registries"

  def show
    @registry = Registry.find(params[:id])
---
SELECT * FROM "registries" WHERE ("registries"."id" = 1)