app/controllers/rsvps_controller.rb

  def create
    @rsvp = Rsvp.new(params[:rsvp])
    if @rsvp.save
---
INSERT INTO "rsvps" ("name", "message", "guest_count", "updated_at", "phone", "attending", "created_at") VALUES('Jeff', '', 1, '2009-11-02 01:42:10', NULL, 'f', '2009-11-02 01:42:10')