app/controllers/static_pages_controller.rb

  def show
    @page = StaticPage.find_by_href(params[:id])
---
SELECT * FROM "static_pages" WHERE ("static_pages"."href" = 'about') LIMIT 1